Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_176-Vimalakirtinirdesa-v1.tmx
Source language: bo
Languages: en

source: །གང་ཡང་ཡིད་ཡོངས་སུ་ཤེས་ནས་ཆོས་ལ་མི་ཆགས། མི་སྡང་། མི་རྨོངས་པ་དེ་ནི་ཞི་བ་ཞེས་བྱའོ།
en: But to know the mind, and to be neither attached, averse, nor confused with regard to phenomena—that is called ‘peace.’

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ལ་ཞབས་ཀྱི་མཐེ་བོས་བསྣུན་པ་དང་།
en: Thereupon the Lord touched the ground of this billion-world galactic universe with his big toe,

source: །དེ་ལ་དགོངས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཐམས་ཅད་བུད་མེད་ཀྱང་མ་ཡིན། སྐྱེས་པའང་མ་ཡིན་ཞེས་གསུངས་སོ།
en: With this in mind, the Buddha said, ‘In all things, there is neither male nor female.’ ”

source: མིག་དང་གཟུགས་སོ་ཞེས་བྱ་བ་དེ་ནི་གཉིས་ཏེ།
en: “ ‘Eye’ and ‘form’ are dualistic.

source: །བྱང་ཆུབ་སེམས་དཔའ་རབ་ཀྱི་བློ་གྲོས་ཀྱིས་སྨྲས་པ།
en: The bodhisattva Sumati declared,

source: །དེ་ནས་ལྷ་མོ་དེས་བྱིན་གྱིས་བརླབས་དེ་བཏང་བ་དང་། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་སླར་ཡང་བདག་གི་གཟུགས་དང་ལྡན་པར་གྱུར་ཏོ།
en: Then, the goddess released her magical power and each returned to their ordinary form.

source: །བཙུན་པ་ཤཱ་རིའི་བུ་ཁྱོད་ཀྱིས་བུད་མེད་ཀྱི་གཟུགས་སུ་བྱས་པ་དེ་ག་རེ།
en: “Reverend Śāriputra, what have you done with your female form?”

source: རིན་པོ་ཆེ་བརྒྱ་སྟོང་དུ་མའི་ཚོགས་དག་རིན་པོ་ཆེ་བརྒྱ་སྟོང་དུ་མ་སོ་སོར་བཀོད་པར་གྱུར་པ་འདི་ལྟ་སྟེ་
en: a magnificent array of many hundreds of thousands of clusters of precious gems,

source: གང་དེ་ལྟར་ཁམས་ལ་འཇུག་པའི་ཡེ་ཤེས་དེ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: The gnosis that penetrates the elements in such a way is the entrance into nonduality.”

source: །དེ་བཞིན་དུ་ད་ལྟར་ཡང་ནམ་མཁའི་རང་བཞིན་ཏེ།
en: Likewise, the present itself is also the nature of space.

source: །ཕྱི་མའི་མཐའ་ཡང་ནམ་མཁའི་རང་བཞིན་ནོ།
en: The future itself is also the nature of space.

source: དཔེར་ན་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེ་བཀོད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཡོན་ཏན་རིན་ཆེན་མཐའ་ཡས་བཀོད་པ་བཞིན་དུ་འཇིག་རྟེན་གྱི་ཁམས་འདིའང་དེ་འདྲའོ།
en: until it resembled the universe of the Tathāgata Ratnavyūha, called Ananta­guṇa­ratna­vyūha.

source: །སྔོན་གྱི་མཐའ་ཡང་ནམ་མཁའི་རང་བཞིན་ནོ།
en: The past itself is also the nature of space.

source: ཁམས་བཞི་པོ་ནི་ནམ་མཁའི་རང་བཞིན་ནོ།
en: The four main elements are themselves the nature of space.

source: ཁམས་བཞི་པོ་ཡང་གཞན་ལ་ནམ་མཁའི་ཁམས་ཀྱང་གཞན་ནོ་ཞེས་བྱ་བ་དེ་ནི་གཉིས་ཏེ།
en: “To say that the four main elements are one thing and the etheric space-element another is dualistic.

source: །བྱང་ཆུབ་སེམས་དཔའ་འོད་ཀྱི་ཏོག་གིས་སྨྲས་པ།
en: The bodhisattva Prabhāketu declared,

source: །འདི་ལ་གང་གིས་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་ལ་དེ་བཞིན་དུ་ཤེས་ཤིང་དེ་ལྟ་བུར་ཡེ་ཤེས་ཀྱིས་རིག་པ་དེ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: Such understanding of the five compulsive aggregates and the knowledge of them as such by means of gnosis is the entrance into nonduality.”

source: རྣམ་པར་ཤེས་པའི་རང་བཞིན་ནི་སྟོང་པ་ཉིད་དོ།
en: but the nature of consciousness is itself voidness.

source: རྣམ་པར་ཤེས་པ་བཤིག་པས་སྟོང་པ་མ་ཡིན་གྱི།
en: Voidness does not result from the destruction of consciousness,

source: །རྣམ་པར་ཤེས་པ་ཉིད་ནི་སྟོང་པ་ཉིད་དེ།
en: Consciousness itself is voidness.

source: གཟུགས་བཤིག་པ་ལས་སྟོང་པ་མ་ཡིན་གྱི།
en: Voidness does not result from the destruction of matter,

source: གཟུགས་ཀྱི་རང་བཞིན་ནི་སྟོང་པ་སྟེ།
en: but the nature of matter is itself voidness.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྟོང་པ་ཉིད་ཅེས་བྱ་བ་དེ་ནི་གཉིས་སོ།
en: Therefore, to speak of voidness on the one hand, and of matter, or of sensation, or of intellect, or of motivation, or of consciousness on the other, is entirely dualistic.

source: །མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ་ཞེས་གསུངས་སོ།
en: are attaining perfect buddhahood, and will go on attaining perfect buddhahood.”

source: སངས་རྒྱས་རྣམས་ནི་འདས་པའམ་མ་འོངས་པའམ། ད་ལྟར་བྱུང་བ་མ་ཡིན་ཏེ།
en: The buddhas are neither past, nor present, nor future.

source: བྱང་ཆུབ་ནི་དུས་གསུམ་ལས་ཡང་དག་པར་འདས་པའོ།
en: Their enlightenment transcends the three times!

source: །གནས་བརྟན་གྱིས་དགྲ་བཅོམ་པ་ཐོབ་བམ།
en: But tell me, elder, have you attained the state of arhat?

source: །དེ་ནས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པས་ཚེ་དང་ལྡན་པ་གནས་བརྟན་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then the Licchavi Vimalakīrti said to the venerable elder Śāriputra,

source: །དེ་ན་ཉན་ཐོས་ཀྱི་ཐེག་པ་ཅན་གྱི་ལྷ་དང་མི་རྣམས་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Then, both men and gods who subscribed to the disciple vehicle thought,

source: །བཙུན་པ་ཤཱ་རིའི་བུ་ལྷ་མོ་འདི་ནི་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་དགུ་བཅུ་རྩ་གཉིས་ལ་བསྙེན་བཀུར་བྱས་ཏེ།
en: “Reverend Śāriputra, this goddess has already served ninety-two million billion buddhas.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྫུ་འཕྲུལ་དེ་དག་བརྟུལ་བ་དང་། དེ་ནས་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཕྱིར་སྔོན་གྱི་རང་བཞིན་དུ་གྱུར་པར་སྣང་ངོ་།
en: Then, the Lord withdrew his miraculous power and at once the buddhafield was restored to its usual appearance.

source: །ཐམས་ཅད་མཁྱེན་པ་ནི་ཤེས་རབ་ཀྱི་རང་བཞིན་ནོ།
en: Omniscience is the nature of wisdom,

source: །ཡོངས་སུ་བསྔོ་བ་ཡང་ཐམས་ཅད་མཁྱེན་པའི་རང་བཞིན་ཏེ།
en: and total dedication is the nature of omniscience.

source: །ལིད་ཙ་བཱི་གཞོན་ནུ་གང་དག་ལིད་ཙ་བཱི་གཞོན་ནུ་དཀོན་མཆོག་འབྱུང་གནས་དང་ལྷན་ཅིག་ཏུ་ལྷགས་པ་ལྔ་བརྒྱ་པོ་དེ་དག་ཀྱང་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: and the five hundred Licchavi youths who had accompanied the young Licchavi Ratnākara all attained the conformative tolerance of ultimate birthlessness.

source: །བྱང་ཆུབ་སེམས་དཔའ་བློ་ཟབ་ཀྱིས་སྨྲས་པ།
en: The bodhisattva Gambhīrabuddhi declared,

source: སྟོང་པ་ཉིད་ཀྱང་གཞན་ལ་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ཡང་གཞན་ནོ་ཞེས་བྱ་བ་དེ་ནི་གཉིས་ཏེ།
en: “It is dualistic to say that voidness is one thing, signlessness another, and wishlessness still another.

source: སྟོང་པ་གང་ཡིན་པ་དེ་ལ་མཚན་མ་གང་ཡང་མེད་དོ།
en: What is void has no sign.

source: །མཚན་མ་མེད་པ་ལ་སྨོན་པ་མེད།
en: What has no sign has no wish.

source: །རིགས་ཀྱི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་འགྲོ་བར་སོང་བ་ཡིན།
en: “‌Noble sir, how does the bodhisattva follow the way to attain the qualities of the Buddha?”

source: སྨོན་པ་མེད་པ་ལ་སེམས་དང་། ཡིད་དང་། རྣམ་པར་ཤེས་པ་རྒྱུ་བ་མེད་དེ།
en: Where there is no wish there is no process of thought, mind, or consciousness.

source: གང་རྣམ་པར་ཐར་པ་གཅིག་གི་སྒོ་དེ་ལ་རྣམ་པར་ཐར་པ་ཐམས་ཅད་ཀྱི་སྒོ་རྣམས་སུ་བལྟ་བར་བྱ་བ་དེ་ནི་གཉིས་སུ་མེད་པའི་སྒོར་འཇུག་པའོ།
en: To see the doors of all liberations in the door of one liberation is the entrance into nonduality.”

source: དུད་འགྲོའི་འགྲོ་བར་འགྲོ་ཡང་གླེན་པའི་མུན་པ་མུན་གནག་དང་བྲལ་བ་ཡིན།
en: Even should he go into the states of the animals, he remains free of darkness and ignorance.

source: །བྱང་ཆུབ་སེམས་དཔའ་དབང་པོ་ཞི་བས་སྨྲས་པ།
en: The bodhisattva Sāntendriya declared,

source: སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་ནོ་ཞེས་བྱ་བ་དེ་ནི་གཉིས་ཏེ།
en: “It is dualistic to say ‘Buddha,’ ‘Dharma,’ and ‘Saṅgha.’

source: སངས་རྒྱས་ཀྱི་རང་བཞིན་ནི་ཆོས་སོ།
en: The Dharma is itself the nature of the Buddha,

source: །ཆོས་ཀྱི་རང་བཞིན་ནི་དགེ་འདུན་ཏེ།
en: the Saṅgha is itself the nature of the Dharma,

source: ལྷ་མ་ཡིན་དུ་འགྲོ་བར་འགྲོ་ཡང་ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། དྲེགས་པ་མེད་པ་ཡིན།
en: When he goes into the states of the asuras, he remains free of pride, conceit, and arrogance.

source: གཤིན་རྗེའི་འཇིག་རྟེན་དུ་འགྲོ་བར་འགྲོ་ཡང་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཐམས་ཅད་བླངས་པ་ཡིན།
en: When he goes into the realm of the lord of death, he accumulates the stores of merit and wisdom.

source: མི་གཡོ་བ་དང་གཟུགས་མེད་པའི་འགྲོ་བར་འགྲོ་ཡང་དེའི་འགྲོ་བ་ལ་ཡང་དག་པར་འཇུག་པ་མ་ཡིན།
en: When he goes into the states of motionlessness and immateriality, he does not dissolve therein.

source: འདོད་ཆགས་ཀྱི་འགྲོ་བར་འགྲོ་ཡང་འདོད་པའི་ལོངས་སྤྱོད་ཐམས་ཅད་ལ་འདོད་ཆགས་དང་བྲལ་བ་ཡིན།
en: “He may follow the ways of desire, yet he stays free of attachment to the enjoyments of desire.

source: དེ་དག་ཐམས་ཅད་ཀྱང་འདུས་མ་བྱས་པའོ།
en: and all of them are uncompounded.

source: །འདུས་མ་བྱས་ནི་ནམ་མཁའོ།
en: The uncompounded is infinite space,

source: ཞེ་སྡང་གི་འགྲོ་བར་འགྲོ་ཡང་སེམས་ཅན་ཐམས་ཅད་ལ་ཁོང་ཁྲོ་བ་མེད་པ་ཡིན།
en: He may follow the ways of hatred, yet he feels no anger toward any living being.

source: །ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་ནི་ནམ་མཁའ་དང་མཚུངས་ཏེ།
en: and the processes of all things are equivalent to infinite space.

source: གང་དེ་ལྟར་རྗེས་སུ་འགྲོ་བ་དེ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: Adjustment to this is the entrance into nonduality.”

source: །སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་གྱི་རྒྱན་བཀོད་པ་འདི་སྣང་བ་ན་སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་སོ།
en: When this splendor of the beauty of the virtues of the buddhafield shone forth, eighty-four thousand beings conceived the spirit of unexcelled perfect enlightenment,

source: །བྱང་ཆུབ་སེམས་དཔའ་ཐོགས་པ་མེད་པའི་མིག་གིས་སྨྲས་པ།
en: The bodhisattva Apratihatacakṣu declared,

source: འཇིག་ཚོགས་དང་འཇིག་ཚོགས་འགོག་པ་ཞེས་བྱ་བ་དེ་ནི་གཉིས་ཏེ།
en: “It is dualistic to refer to ‘aggregates’ and to the ‘cessation of aggregates.’

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་བཀའ་སྩལ་པ།
en: Then, the Buddha said to the venerable Śāriputra,

source: གཏི་མུག་གི་འགྲོ་བར་འགྲོ་ཡང་ཆོས་ཐམས་ཅད་ལ་ཤེས་རབ་ཀྱིས་ངེས་པར་རྟོགས་པའི་སེམས་དང་ལྡན་པ་ཡིན།
en: He may follow the ways of folly, yet he is ever conscious with the wisdom of firm understanding.

source: ཤཱ་རིའི་བུ་ཁྱོད་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་འདི་མཐོང་ངམ་གསོལ་པ།
en: “Śāriputra, do you see this splendor of the virtues of the buddhafield?”

source: སེར་སྣའི་འགྲོ་བར་འགྲོ་ཡང་ལུས་དང་སྲོག་ལ་མི་ལྟ་བས་ཕྱི་ནང་གི་དངོས་པོ་ཡོངས་སུ་གཏོང་བ་ཡིན།
en: “He may follow the ways of avarice, yet he gives away all internal and external things without regard even for his own life.

source: །དེ་ནས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེའང་ངོ་མཚར་དུ་གྱུར་ཅིང་བདག་ཉིད་ཀྱང་རིན་པོ་ཆེའི་པད་མ་བཀོད་པའི་སྟན་ལ་འདུག་པ་སྙམ་བྱེད་དོ།
en: Everyone in the entire assembly was filled with wonder, each perceiving himself seated on a throne of jeweled lotuses.

source: ཚུལ་ཁྲིམས་འཆལ་པའི་འགྲོ་བར་འགྲོ་ཡང་ཁ་ན་མ་ཐོ་བ་ཅུང་ཟད་ལའང་འཇིགས་པར་ལྟ་ཞིང་སྦྱངས་པའི་ཡོན་ཏན་དང་ཡོ་བྱད་བསྙུངས་པ་ཐམས་ཅད་ལ་གནས་པ་ཡིན།
en: He may follow the ways of immorality, yet, seeing the horror of even the slightest transgressions, he lives by the ascetic practices and austerities.

source: །བཀའ་སྩལ་པ།
en: The Buddha said,

source: གནོད་སེམས་ཀྱི་ཐ་བ་དང་ཁོང་ཁྲོ་བའི་འགྲོ་བར་འགྲོ་ཡང་ཤིན་ཏུ་གནོད་སེམས་མེད་ཅིང་བྱམས་པ་ལ་གནས་པ་ཡིན།
en: He may follow the ways of wickedness and anger, yet he remains utterly free of malice and lives by love.

source: ལེ་ལོའི་འགྲོ་བར་འགྲོ་ཡང་བརྩོན་འགྲུས་རྩོམ་པ་རྒྱུན་མི་འཆད་ཅིང་། དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཡོངས་སུ་ཚོལ་བ་ལ་བརྩོན་པ་ཡིན།
en: He may follow the ways of laziness, yet his efforts are uninterrupted as he strives in the cultivation of roots of virtue.

source: དབང་པོ་འཁྲུལ་པའི་འགྲོ་བར་འགྲོ་ཡང་རང་བཞིན་གྱིས་སྙོམས་པར་ཞུགས་ཤིང་བསམ་གཏན་དོན་ཡོད་པ་ཡིན།
en: He may follow the ways of sensuous distraction, yet, naturally concentrated, his contemplation is not dissipated.

source: འཇིག་ཚོགས་ཉིད་ནི་འགོག་པའོ།
en: Aggregates themselves are cessation.

source: འཆལ་པའི་ཤེས་རབ་ཀྱི་འགྲོ་བར་འགྲོ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་འགྲོ་བར་སོང་ཞིང་འཇིག་རྟེན་པ་དང་འཇིག་རྟེན་ལས་འདས་པའི་བསྟན་བཅོས་ཐམས་ཅད་ལ་མཁས་པ་ཡིན།
en: He may follow the ways of false wisdom, yet, having reached the transcendence of wisdom, he is expert in all mundane and transcendental sciences.

source: ཚུལ་འཆོས་པ་དང་ཁ་གསག་བྱེད་པའི་འགྲོ་བར་འགྲོ་ཡང་ལྡེམ་པོ་ངག་ལ་མཁས་ཤིང་ཐབས་མཁས་པའི་སྤྱོད་པ་ཚར་ཕྱིན་པ་ཡང་ཡིན།
en: “He may show the ways of sophistry and contention, yet he is always conscious of ultimate meanings and has perfected the use of liberative arts.

source: ང་རྒྱལ་གྱི་འགྲོ་བའང་སྟོན་ལ་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་ཟམ་པ་དང་སྟེགས་བུར་འགྱུར་བ་ཡང་ཡིན།
en: He may show the ways of pride, yet he serves as a bridge and a ladder for all people.

source: ཤཱ་རིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་ལྷའི་བུ་རྣམས་རིན་པོ་ཆེའི་སྣོད་གཅིག་ཏུ་ཟས་ཟ་ཡང་
en: Śāriputra, the gods of the Trayastriṃśa heaven all take their food from a single precious vessel,

source: བསོད་ནམས་ཇི་ལྟ་བུ་བསགས་པའི་བྱེ་བྲག་གིས་ལྷའི་ཟས་བདུད་རྩི་ཉེ་བར་གནས་པ་
en: yet the nectar that nourishes each one differs according to the differences of the merits each has accumulated.

source: གང་ཆོས་ཐམས་ཅད་ཀྱི་མངོན་པར་འདུ་མི་བྱེད་པ་དེ་ཡིན་པར་ཤེས་པར་བྱ། རྗེས་སུ་རིག་པར་བྱ་སྟེ།
en: It is necessary to know and to understand this fact of the ultimate inactivity of all things,

source: དེ་བཞིན་དུ་ཤཱ་རིའི་བུ་སེམས་ཅན་སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་ཏུ་སྐྱེས་པ་དག་ཀྱང་སེམས་ཅན་ཇི་ལྟར་ཡོངས་སུ་དག་པ་བཞིན་དུ་སངས་རྒྱས་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་མཐོང་ངོ་།
en: Just so, Śāriputra, living beings born in the same buddhafield see the splendor of the virtues of the buddhafields of the buddhas according to their own degrees of purity.”

source: །ཡིད་ཀྱི་མངོན་པར་འདུ་མི་བྱེད་པའང་དེའི་མཚན་ཉིད་དེ།
en: whose nature of inactivity is the same as the nature of inactivity of the mind.

source: ལུས་ཀྱི་མངོན་པར་འདུ་མི་བྱེད་པ་གང་ཡིན་པ་ངག་གི་མངོན་པར་འདུ་མི་བྱེད་པའང་དེའི་མཚན་ཉིད་དོ།
en: The nature of inactivity of the body is the same as the nature of inactivity of speech,

source: ཉོན་མོངས་པའི་འགྲོ་བར་འགྲོ་ཡང་ཤིན་ཏུ་ཀུན་ནས་ཉོན་མོངས་པ་མེད་ཅིང་རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པ་ཡང་ཡིན།
en: He may show the ways of the passions, yet he is utterly dispassionate and naturally pure.

source: བདུད་ཀྱི་འགྲོ་བར་འགྲོ་ཡང་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་གཞན་གྱི་དྲིང་ལ་མི་འཇོག་པ་ཡང་ཡིན།
en: He may follow the ways of the māras, yet he does not really accept their authority in regard to his knowledge of the qualities of the Buddha.

source: ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་སྡོམ་པ་ཞེས་བྱ་བ་དེ་ནི་གཉིས་སུ་མེད་དེ།
en: “Physical, verbal, and mental vows do not exist dualistically.

source: ཤཱ་རིའི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནི་རྟག་ཏུ་འདི་འདྲ་མོད་ཀྱི་
en: “Śāriputra, this buddhafield is always thus pure,

source: ཉན་ཐོས་ཀྱི་འགྲོ་བར་འགྲོ་ཡང་སེམས་ཅན་རྣམས་ལ་མ་ཐོས་པའི་ཆོས་ཐོས་པར་བྱེད་པ་ཡང་ཡིན།
en: He may follow the ways of the disciples, yet he lets living beings hear the teaching they have not heard before.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཤིན་ཏུ་དུལ་བས་སྨྲས་པ།
en: The bodhisattva Suvinīta declared,

source: རང་སངས་རྒྱས་ཀྱི་འགྲོ་བར་འགྲོ་ཡང་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སྙིང་རྗེ་ཆེན་པོ་ལས་བྱུང་བ་ཡང་ཡིན།
en: He may follow the ways of the solitary sages, yet he is inspired with great compassion in order to develop all living beings.

source: དབུལ་པོའི་འགྲོ་བར་འགྲོ་ཡང་ལོངས་སྤྱོད་ཟད་མི་ཤེས་པའི་རིན་པོ་ཆེ་ལག་ན་ཐོགས་པ་ཡང་ཡིན།
en: “He may follow the ways of the poor, yet he holds in his hand a jewel of inexhaustible wealth.

source: དབང་པོ་ཉམས་པའི་འགྲོ་བར་འགྲོ་ཡང་གཟུགས་བཟང་ཞིང་མཚན་གྱིས་ལེགས་པར་བརྒྱན་པ་ཡང་ཡིན།
en: He may follow the ways of cripples, yet he is beautiful and well adorned with the auspicious signs and marks.

source: རིགས་ངན་པར་སྐྱེ་བའི་འགྲོ་བར་འགྲོ་ཡང་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་བསགས་པས་དེ་བཞིན་གཤེགས་པའི་གདུང་རབ་ཏུ་སྐྱེ་བར་འགྱུར་བ་ཡང་ཡིན།
en: He may follow the ways of those of lowly birth, yet, through his accumulation of the stores of merit and wisdom, he is born in the family of the tathāgatas.

source: སེམས་ཅན་དམན་པ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱས་པའི་ཕྱིར་
en: in order to bring about the maturity of inferior living beings.

source: དེ་བཞིན་གཤེགས་པས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ལྟ་བུར་ཉེས་པ་མང་པོའི་སྐྱོན་ཆགས་པར་སྟོན་ཏེ།
en: but the Tathāgata makes it appear to be spoiled by many faults,

source: ཉམ་ཆུང་ཞིང་མདོག་ངན་པ་གཞན་པའི་འགྲོ་བར་འགྲོ་ཡང་བལྟ་ན་སྡུག་པ་དང་། སྲེད་མེད་ཀྱི་བུའི་ལུས་ལྟ་བུ་ཐོབ་པ་ཡང་ཡིན།
en: He may follow the ways of the weak, the ugly, and the wretched, yet he is beautiful to look upon, and his body is like that of Nārāyaṇa.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ན་བ་དང་། མི་བདེ་བའི་སྤྱོད་པའང་སྟོན་ལ་འཆི་བའི་འཇིགས་པ་ལས་ཤིན་ཏུ་འདས་ཤིང་རབ་ཏུ་ཆོམས་པ་ཡང་ཡིན།
en: “He may manifest to living beings the ways of the sick and the unhappy, yet he has entirely conquered and transcended the fear of death.

source: ལོངས་སྤྱོད་ཀྱི་འགྲོ་བར་འགྲོ་ཡང་བཙལ་བ་ཐམས་ཅད་མེད་ཅིང་མི་རྟག་པའི་འདུ་ཤེས་ལ་སོ་སོར་རྟོག་པ་མང་བ་ཡང་ཡིན།
en: “He may follow the ways of the rich, yet he is without acquisitiveness and often reflects upon the notion of impermanence.

source: །བྱང་ཆུབ་སེམས་དཔའ་བསོད་ནམས་ཞིང་གིས་སྨྲས་པ།
en: The bodhisattva Puṇyakṣetra declared,

source: ཀྱེ་མའོ་འདུ་བྱེད་འདི་དག་ནི་མི་རྟག་གོ་སྙམ་དུ་རིག་ནས་སྲོག་ཆགས་སུམ་ཁྲི་ཉིས་སྟོང་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ།
en: “Alas! All constructed things are impermanent.” Thereby, thirty-two thousand living beings purified their immaculate, undistorted Dharma-eye in regard to all things.

source: །དགེ་སློང་བརྒྱད་སྟོང་ནི་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ།
en: The eight thousand bhikṣus were liberated from their mental defilements, attaining the state of nongrasping.

source: །སངས་རྒྱས་ཀྱི་ཞིང་རྒྱ་ཆེན་པོ་ལ་མོས་པའི་སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡང་
en: And the eighty-four thousand living beings who were devoted to the grandeur of the buddhafield,

source: བསོད་ནམས་དང་། བསོད་ནམས་མ་ཡིན་པ་དང་། མི་གཡོ་བ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་འདུ་བྱེད་དོ་ཞེས་བྱ་བ་དེ་ནི་གཉིས་ཏེ།
en: “It is dualistic to consider actions meritorious, sinful, or unmoving.

source: བྱང་ཆུབ་སེམས་དཔས་སླས་དང་གར་ཐབས་མང་པོ་སྟོན་ཀྱང་དབེན་པར་སྤྱོད་ཅིང་འདོད་པའི་འདམ་ལས་རྒལ་བ་ཡང་ཡིན།
en: He may show himself engaged in dancing with harem girls, yet he cleaves to solitude, having crossed the swamp of desire.

source: ཆོས་ཐམས་ཅད་རྣམ་པར་བསྒྲུབས་པས་ཉེ་བར་གཞག་པའི་མཚན་ཉིད་དུ་རིག་ནས་
en: having understood that all things are by nature but magical creations,

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་སོ།
en: all conceived in their own minds the spirit of unexcelled, totally perfect enlightenment.

source: སེམས་ཅན་ཚུལ་ཁྲིམས་འཆལ་པ་རྣམས་བསྡུ་བའི་ཕྱིར་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ།
en: He observed a pure morality in order to protect the immoral.

source: སེམས་ཅན་མགོན་མེད་པ་དང་དབུལ་པོ་རྣམས་བསྡུ་བའི་ཕྱིར་ལོངས་སྤྱོད་ཟད་མི་ཤེས་པ།
en: His wealth was inexhaustible for the purpose of sustaining the poor and the helpless.

source: སངས་རྒྱས་ཀྱི་སྤྱོད་ལམ་ལ་གནས་པ།
en: He lived with the deportment of a buddha,

source: བློ་དམ་པ་རྒྱ་མཚོ་ལྟ་བུའི་རྗེས་སུ་ཞུགས་པ།
en: and his superior intelligence was as wide as an ocean.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བསྟོད་ཅིང་བཀུར་ཏེ་རབ་ཏུ་བསྔགས་པ།
en: He was praised, honored, and commended by all the buddhas

source: བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་ཐམས་ཅད་ཀྱིས་ཕྱག་བྱས་པ་དེ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཐབས་ལ་མཁས་པས་ཡངས་པའི་གྲོང་ཁྱེར་ཆེན་པོ་ན་གནས་ཏེ།
en: and was respected by Indra, Brahmā, and all the Lokapālas. In order to develop living beings with his skill in liberative art, he lived in the great city of Vaiśālī.

source: སེམས་ཅན་གྱི་དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་ཤེས་པ་ལས་ངེས་པར་བྱུང་བ་སོ་སོ་ཅི་རིགས་པར་ཆོས་སྟོན་པ།
en: Knowing the strength or weakness of their faculties, and being gifted with unrivaled eloquence, he taught the Dharma appropriately to each.

source: ཐབས་མཁས་པ་རྟོགས་པར་ཁོང་དུ་ཆུད་པ། སྤོབས་པ་དང་ལྡན་པ། སེམས་ཅན་གྱི་བསམ་པ་དང་སྤྱོད་པ་ལ་མཁས་པ།
en: Having integrated his realization with skill in liberative art, he was expert in knowing the thoughts and actions of living beings.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་ངེས་པར་བྱུང་བ།
en: He was liberated through the transcendence of wisdom.

source: ཆོས་ཀྱི་ཚུལ་ཟབ་མོ་ལ་ཤིན་ཏུ་ཞུགས་པ།
en: He had penetrated the profound way of the Dharma.

source: བདུད་དང་ཕྱིར་རྒོལ་བ་བཅོམ་པ།
en: He had conquered all demons and opponents.

source: གཟུངས་ཐོབ་པ། མི་འཇིགས་པ་ཐོབ་པ།
en: He had attained the power of incantations and the fearlessnesses.

source: ཐེག་པ་ཆེན་པོ་འདི་ལ་བརྩོན་པར་བྱས་ཤིང་ཤེས་པར་བྱས་པ། ཤིན་ཏུ་བརྟགས་ཏེ་ལས་བྱེད་པ།
en: Having applied himself energetically to the Mahāyāna, he understood it and accomplished his tasks with great finesse.

source: མྱ་ངན་ལས་འདས་པ་ལ་མངོན་པར་དགའ་ཞིང་འཁོར་བ་ལ་མི་དགའ་བ་དེ་ནི་གཉིས་ཏེ། གང་མྱ་ངན་ལས་འདས་པ་ལ་ཡང་མངོན་པར་དགའ་བ་མེད་པ། འཁོར་བ་ལ་ཡང་མི་དགའ་བ་མེད་པ་དེ་ནི་གཉིས་སུ་མེད་པའོ།
en: “It is dualistic to detest the world and to rejoice in liberation, and neither detesting the world nor rejoicing in liberation is nonduality.

source: །བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་ཕྱག་རྒྱ་རིན་པོ་ཆེས་སྨྲས་པ།
en: The bodhisattva Ratna­mudrā­hasta declared,

source: ཆོས་ཐམས་ཅད་ཀྱི་མཚན་ཉིད་ཀྱང་དེ་བཞིན་ཏེ།
en: and likewise with the natures of all things.

source: གང་མཉམ་པ་ཉིད་འདི་ལ་འཇུག་པ་དེ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: The entrance into this equanimity is the entrance into nonduality.”

source: མུན་པ་དང་སྣང་བ་ཞེས་བྱ་བ་དེ་ནི་གཉིས་ཏེ། མུན་པའང་མེད། སྣང་བའང་མེད་པ་དེ་ནི་གཉིས་སུ་མེད་པའོ།
en: “ ‘Darkness’ and ‘light’ are dualistic, but the absence of both darkness and light is nonduality.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཟླ་བའི་བླ་མས་སྨྲས་པ།
en: The bodhisattva Candrottara declared,

source: དམིགས་པས་རབ་ཏུ་ཕྱེ་བ་དེ་ནི་གཉིས་སོ།
en: “Duality is constituted by perceptual manifestation.

source: །གང་མི་དམིགས་པ་དེ་ནི་གཉིས་སུ་མེད་པ་སྟེ།
en: Nonduality is objectlessness.

source: དེའི་ཕྱིར་གང་ལེན་པ་མེད་ཅིང་འདོར་བ་མེད་པ་དེ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: Therefore, nongrasping and nonrejection is the entrance into nonduality.”

source: །བྱང་ཆུབ་སེམས་དཔའ་དཔལ་གྱི་སྙིང་པོས་སྨྲས་པ།
en: The bodhisattva Śrīgarbha declared,

source: །དེ་ལྟར་གཉིས་སུ་མེད་པར་གནས་པ་ལ་རྣམ་པར་རིག་པ་མེད་པས་རྣམ་པར་རིག་པ་མེད་པ་དེ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: Who thus abides in nonduality is without ideation, and that absence of ideation is the entrance into nonduality.”

source: ། ཉོན་མོངས་པའི་འབྱུང་གནས་འདུས་བྱས་ལ་གནས་པ་བདེན་པ་མ་མཐོང་བས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནུས་སོ།
en: However, one who lives among created things, in the mines of passions, without seeing any truth, is indeed capable of conceiving the spirit of unexcelled perfect enlightenment.

source: བདག་ཡོངས་སུ་ཤེས་པ་དེ་ནི་གཉིས་མི་སློང་ངོ་།
en: but true understanding of self does not result in dualism.

source: བདག་ཀུན་ནས་ལྡང་བ་ལས་སྐྱེས་པ་དེ་ནི་གཉིས་ཏེ།
en: “Dualism is produced from obsession with self,

source: །བྱང་ཆུབ་སེམས་དཔའ་པད་མ་བཀོད་པས་སྨྲས་པ།
en: The bodhisattva Padmavyūha declared,

source: གང་དེ་ལྟར་མི་སྒྲུབ་པ་དེ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: The nonaccomplishment of such actions is the entrance into nonduality.”

source: །རིགས་ཀྱི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་རིགས་ཏེ་རིགས་ཀྱི་བུ་མདོར་ན་ལྟ་བར་གྱུར་པ་དྲུག་ཅུ་རྩ་གཉིས་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་རིགས་སོ།
en: In short, noble sir, the sixty-two kinds of convictions constitute the family of the tathāgatas!”

source: གང་ཤིན་ཏུ་མ་བཅིངས་པ་དེ་ཐར་པ་ག་ལ་ཚོལ།
en: but where there is ultimately no bondage where is there need for liberation?

source: མ་བཅིངས་མ་གྲོལ་བའི་དགེ་སློང་གིས་ནི་དགའ་བ་དང་མི་དགའ་བ་ཡང་མི་རྙེད་དེ། དེ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: The mendicant who is neither bound nor liberated does not experience any like or any dislike and thus he enters nonduality.”

source: །བྱང་ཆུབ་སེམས་དཔའ་ནོར་བུ་བརྩེགས་པའི་རྒྱལ་པོས་སྨྲས་པ།
en: The bodhisattva Maṇikūṭarāja declared,

source: ལམ་དང་ལམ་ངན་པའོ་ཞེས་བྱ་བ་དེ་ནི་གཉིས་ཏེ།
en: “It is dualistic to speak of ‘good paths’ and ‘bad paths’.

source: ལམ་དུ་ཞུགས་པ་ལ་ནི་ལམ་ངན་པ་མི་སྤྱོད་དོ།
en: One who is on the path is not concerned with good or bad paths.

source: །བྱང་ཆུབ་སེམས་དཔའ་བདེན་དགས་སྨྲས་པ།
en: The bodhisattva Satyananda declared,

source: བདེན་པ་དང་བརྫུན་པ་ཞེས་བྱ་བ་དེ་ནི་གཉིས་ཏེ།
en: “It is dualistic to speak of ‘true’ and ‘false.’

source: བདེན་པ་མཐོང་བས་ཀྱང་བདེན་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ན་བརྫུན་པ་ལྟ་ག་ལ་མཐོང་།
en: When one sees truly, one does not ever see any truth, so how could one see falsehood?

source: །དེ་ནས་གནས་བརྟན་འོད་སྲུང་ཆེན་པོས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: Then, the elder Mahākāśyapa applauded the crown prince Mañjuśrī:

source: ལེགས་སོ་ལེགས་སོ། །འཇམ་དཔལ་ཚིག་འདི་ནི་ལེགས་པར་སྨྲས་པ་འདི་ནི་ཡང་དག་གོ།
en: “Good! Good, Mañjuśrī! This is indeed well spoken! This is right!

source: །དེ་བཞིན་དུ་ཉོན་མོངས་པའི་རྒྱ་མཚོར་མ་ཞུགས་པར་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དེ་ལས་སྐྱེད་པར་མི་ནུས་སོ།
en: so likewise, without going into the ocean of passions, it is impossible to obtain the mind of omniscience.

source: བཟོད་པ་ཐོབ་པ། སྤོབས་པ་ཐོབ་པ།
en: He had attained tolerance as well as eloquence.

source: སྔོན་གྱི་རྒྱལ་བ་ལ་ལྷག་པར་བྱ་བ་བྱས་ཤིང་དགེ་བའི་རྩ་བ་བསྐྱེད་པ། སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་བྱས་པ།
en: Having served the ancient buddhas, he had generated the roots of virtue by honoring them and making offerings to them.
